In [ ]:
print("installing MySQL...")
!apt-get install mysql-server > /dev/null

# start MySQL
print("starting MySQL...")
!service mysql start

# create MySQL user
print("creating MySQL user...")
!mysql -e "ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'root'"

# save password locally for easy log in
!printf "[client]\npassword = root" > ~/.my.cnf

# install Python MySQL
print("installing MySQL for Python...")
!pip -q install PyMySQL

# create MySQL connection
%load_ext sql
%config SqlMagic.feedback=False 
%config SqlMagic.autopandas=True
%sql mysql+pymysql://root:root@/
# query using %sql or %%sql
df = %sql SELECT Host, User, authentication_string FROM mysql.user
df

installing MySQL...
W: APT had planned for dpkg to do more than it reported back (3 vs 7).
   Affected packages: mysql-server-5.7:amd64
starting MySQL...
 * Starting MySQL database server mysqld
   ...done.
creating MySQL user...
installing MySQL for Python...
The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * mysql+pymysql://root:***@/

        Host              User                      authentication_string
0  localhost              root  *81F5E21E35407D884A6CD4A731AEBFB6AF209E1B
1  localhost     mysql.session  *THISISNOTAVALIDPASSWORDTHATCANBEUSEDHERE
2  localhost         mysql.sys  *THISISNOTAVALIDPASSWORDTHATCANBEUSEDHERE
3  localhost  debian-sys-maint  *85682511E0F7A351B2C858BCE7293EA14509E733

In [ ]:
#DOWNLOAD DATA FROM 
# https://drive.google.com/file/d/1kaAJ2BOvDzyl_gXf2RtbaHIsVkNA4yDC/view?usp=sharing
# and upload to Colab (click the folder on the left panel, then click the file upload)

In [ ]:
# load database from file
%sql CREATE DATABASE lacc
!mysql -u root lacc < lacc_orders.sql 
%sql USE lacc
%sql SHOW TABLES;

 * mysql+pymysql://root:***@/
(pymysql.err.ProgrammingError) (1007, "Can't create database 'lacc'; database exists")
[SQL: CREATE DATABASE lacc]
(Background on this error at: http://sqlalche.me/e/14/f405)
 * mysql+pymysql://root:***@/
 * mysql+pymysql://root:***@/

  Tables_in_lacc
0     categories
1  item_category
2          items
3    order_items
4         orders

In [ ]:
#show all orders
%%sql 
SELECT *
FROM items

 * mysql+pymysql://root:***@/

      id                      name  ... price  qty
0      1                      Eggs  ...   269   12
1      2               White Bread  ...   299    0
2      3       Arnold Whole Grains  ...   499    0
3      4  Clover Farms, Whole Milk  ...   299    0
4      5     Clover Farms, 2% Milk  ...   299    8
..   ...                       ...  ...   ...  ...
369  377     Backwoods, Dark Stout  ...   799    3
370  378      Lava2, Black Pod Mod  ...  2799    1
371  379    Lava2, Rainbow Pod Mod  ...  2799    2
372  380  Lava2, Rose Gold Pod Mod  ...  2799    4
373  381       Lava2, Blue Pod Mod  ...  2799    3

[374 rows x 5 columns]

In [ ]:
#Question 1: show all items in the market
%sql SELECT * FROM items;

In [ ]:
#Question 2: show all categories in the market

In [ ]:
#Question 3: show all item_category in the market

In [ ]:
#Question 4: show all order_items in the market

In [ ]:
#Question 5: show only name and price of all items in the market

In [ ]:
#Question 6: show only main categories of each category
%sql

In [ ]:
#Q7: show only main categories, without repeating
%sql

In [ ]:
#Q8: how many main categories are there
%sql

In [ ]:
#Q9: how many categories do we have? show result with column name "NumberOfCategories"
%sql

In [ ]:
#Q10: show all items with a price of less than $10
%sql

In [ ]:
#Q11: show all items with a price less than $5 that is currently in stock
%sql

In [ ]:
#Q12: show all items in stock, ordered by price with the most expensive item first
%sql

In [ ]:
#Q13: show the 10 most expensive items in stock
%sql

In [ ]:
#Q14: show a list of all item names and their category number. If an item is in multiple categories, show the item once for each category number.
%sql

In [ ]:
#Q15: show a list of all item names, their category name, and their subcategory name. If an item is in multiple categories, show the item once for each category.
%sql

In [ ]:
#Q16: For each category, show the number of subcategories
%sql

In [ ]:
#Q17: For each uid in orders, show the number of orders made by that user uid
%sql

In [ ]:
#Q18: for each item, show the number of times it has been ordered
%sql

In [ ]:
#Q19: what is the most popular item in the store?
%sql

In [ ]:
#Q20: show all items that have been ordered more than 50 times
%sql

In [ ]:
#Q21: show a list of all items ordered in June 2021 that are currently out of stock
%sql

In [ ]:
#Q22: show the number of orders placed every month starting from January 2021
%sql

In [ ]:
#Q23: how much money has been spent at the store?
%sql

In [ ]:
#Q24: how much tip has been made?
%sql

In [ ]:
#Q25: who has the fastest delivered orders on average? what is their average delivery time?
%sql

In [ ]:
#Q26: what is the average delivery time in each year-month? hopefully the delivery time is improving!
%sql

In [ ]:
#Q27: how many items have been ordered from each main category?
%sql

In [ ]:
#Q28: what are the top three most popular main categories?
%sql

In [ ]:
#Q29: what are the top five most popular subcategories?
%sql

In [ ]:
#Q30: how much money has been spent on items from each subcategory?
%sql

In [ ]:
#Q31: which hour is the most popular for the store?
%sql

In [ ]:
#Q32: for each user, what was the first time they placed an order? show only the first time, once per user
%sql

In [ ]:
#Q??: what interesting conclusions can *you* derive from the data?
%sql